# Используем официальный образ Go в качестве базового
FROM golang:1.22-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем go.mod и go.sum для установки зависимостей
COPY go.mod go.sum ./

# Устанавливаем зависимости
RUN go mod download

# Копируем исходный код приложения в рабочую директорию
COPY . .

# Сборка приложения
RUN go build -o myapp ./cmd/main.go

# Экспонируем порт, на котором будет работать наше приложение

# Указываем команду для запуска приложения
CMD ["./myapp"]
